In [1]:
import numpy as np
import pandas as pd

## Creating a DataFrame

In [4]:
data = {
    'Name': ['John','Anna','Peter','Linda'],
    'Age': [28,34,29,42],
    'City':['Paris','Moscow','Berlin','Jerusalem'],
    'Salary':[65000,70000,56000,60000]  }
df=pd.DataFrame(data)

In [5]:
df

    Name  Age       City  Salary
0   John   28      Paris   65000
1   Anna   34     Moscow   70000
2  Peter   29     Berlin   56000
3  Linda   42  Jerusalem   60000

In [19]:
data_list=[
    ['John',28,'New York',65000],
    ['Proffessor',28,'Berlin',55000],
    ['Harry',28,'Moscow',60000],
    ['Alice',28,'Paris',50000],
]
df2=pd.DataFrame(data_list)
column=['Name','Age','City','Salary']
df2=pd.DataFrame(data_list,columns=column) #here columns is a key word argument
df2

         Name  Age      City  Salary
0        John   28  New York   65000
1  Proffessor   28    Berlin   55000
2       Harry   28    Moscow   60000
3       Alice   28     Paris   50000

In [18]:
df2

            0   1         2      3
0        John  28  New York  65000
1  Proffessor  28    Berlin  55000
2       Harry  28    Moscow  60000
3       Alice  28     Paris  50000

## Selection and indexing of columns

In [22]:
#lets select df2 to select unique series  
df2

         Name  Age      City  Salary
0        John   28  New York   65000
1  Proffessor   28    Berlin   55000
2       Harry   28    Moscow   60000
3       Alice   28     Paris   50000

In [23]:
df2['City']

0    New York
1      Berlin
2      Moscow
3       Paris
Name: City, dtype: object

In [24]:
# How select multiple columns
df2[['Name','City']]

         Name      City
0        John  New York
1  Proffessor    Berlin
2       Harry    Moscow
3       Alice     Paris

## Creating a new Column

In [25]:
df2["Designation"] = ["Assasin","Teacher","Magician","Gamer"]

In [40]:
df2

         Name      City  Salary Designation
0        John  New York   65000     Assasin
1  Proffessor    Berlin   55000     Teacher
2       Harry    Moscow   60000    Magician
3       Alice     Paris   50000       Gamer

## Removing a Colomn

In [27]:
df2.drop('Age',axis=1)

         Name      City  Salary Designation
0        John  New York   65000     Assasin
1  Proffessor    Berlin   55000     Teacher
2       Harry    Moscow   60000    Magician
3       Alice     Paris   50000       Gamer

In [28]:
df2

         Name  Age      City  Salary Designation
0        John   28  New York   65000     Assasin
1  Proffessor   28    Berlin   55000     Teacher
2       Harry   28    Moscow   60000    Magician
3       Alice   28     Paris   50000       Gamer

In [29]:
#But we want to delete the data related to age completely not temporarily therefore,
df2.drop('Age',axis=1,inplace=True)

In [30]:
df2

         Name      City  Salary Designation
0        John  New York   65000     Assasin
1  Proffessor    Berlin   55000     Teacher
2       Harry    Moscow   60000    Magician
3       Alice     Paris   50000       Gamer

In [31]:
#To delete multiple things,
df2.drop(['City','Salary'],axis=1)

         Name Designation
0        John     Assasin
1  Proffessor     Teacher
2       Harry    Magician
3       Alice       Gamer

In [32]:
#To delete rows,
df2.drop(0,axis=0) #This will delete first row

         Name    City  Salary Designation
1  Proffessor  Berlin   55000     Teacher
2       Harry  Moscow   60000    Magician
3       Alice   Paris   50000       Gamer

## Selecting a Row

In [42]:
df2

         Name      City  Salary Designation
0        John  New York   65000     Assasin
1  Proffessor    Berlin   55000     Teacher
2       Harry    Moscow   60000    Magician
3       Alice     Paris   50000       Gamer

In [34]:
df2.loc[0] #here i'm selecting first row ,and loc means location

Name               John
City           New York
Salary            65000
Designation     Assasin
Name: 0, dtype: object

In [36]:
#To slect multiple rows
df2.loc[[0,1]]

         Name      City  Salary Designation
0        John  New York   65000     Assasin
1  Proffessor    Berlin   55000     Teacher

In [38]:
#To select subSet of rows and column
df.loc[[0,1]] [['City','Salary']]

     City  Salary
0   Paris   65000
1  Moscow   70000

In [44]:
#Revision
df2.loc[[2,3]] [['Name','City']]

    Name    City
2  Harry  Moscow
3  Alice   Paris

## Conditional Selection

In [45]:
df2

         Name      City  Salary Designation
0        John  New York   65000     Assasin
1  Proffessor    Berlin   55000     Teacher
2       Harry    Moscow   60000    Magician
3       Alice     Paris   50000       Gamer

In [46]:
#what if ,i only want to se  people whose salary is above 55000,here comes idea for conditional selection

In [47]:
df2[df2["Salary"] > 55000]

    Name      City  Salary Designation
0   John  New York   65000     Assasin
2  Harry    Moscow   60000    Magician

In [48]:
#what if ,i only want to see  people whose salary is above 55000 and city = Moscow

In [49]:
df2[(df2["Salary"] > 55000) & (df2['City']== 'Moscow')]

    Name    City  Salary Designation
2  Harry  Moscow   60000    Magician